phoenix-rtos/phoenix-rtos-devices/cpu/imxrt117x-cm4/imxrt117x-cm4.c
/*
 * Phoenix-RTOS
 *
 * i.MX RT117x M4 cpu core driver
 *
 * Copyright 2021 Phoenix Systems
 * Author: Aleksander Kaminski
 *
 * %LICENSE%
 */

#include <stdio.h>
#include <errno.h>
#include <string.h>
#include <stdint.h>
#include <sys/msg.h>
#include <posix/utils.h>
#include <sys/platform.h>
#include <phoenix/arch/imxrt1170.h>

#include "imxrt117x-cm4.h"

#define M4_MEMORY_START ((void *)0x20200000)
#define M4_VTORS        (0x1ffe0000)
#define M4_MEMORY_SIZE  (256 * 1024)

struct {
	unsigned int port;
	volatile void *m4memory;
	size_t m4memorysz;

	volatile uint32_t *scr;
} m4_common;


enum { chan0 = 0, chan1, chan2, chan3, chanLen };


enum { scr_scr = 0, scr_smsr };


static ssize_t chanRead(id_t id, void *buff, size_t bufflen)
{
	/* TODO */
	return -ENOSYS;
}


static ssize_t chanWrite(id_t id, const void *buff, size_t bufflen)
{
	/* TODO */
	return -ENOSYS;
}


static int runCore(void)
{
	platformctl_t pctl;
	static const unsigned int vectors = (unsigned int)M4_MEMORY_START + 0x100;

	/* Set CM4's VTOR to the start of it's memory */
	pctl.action = pctl_set;
	pctl.type = pctl_iolpsrgpr;
	pctl.iogpr.field = 0;
	pctl.iogpr.val = vectors & 0xffff;

	if (platformctl(&pctl))
		return -EIO;

	pctl.action = pctl_set;
	pctl.type = pctl_iolpsrgpr;
	pctl.iogpr.field = 1;
	pctl.iogpr.val = (vectors >> 16) & 0xffff;

	if (platformctl(&pctl))
		return -EIO;

	/* Release the Kraken */
	*(m4_common.scr + scr_smsr) |= 0xf << 10;
	__asm__ volatile("dmb");
	*(m4_common.scr + scr_scr) = 3;

	return EOK;
}


static int loadFromFile(const char *path)
{
	char buff[256];
	FILE *f;
	size_t r, total = 0;
	volatile char *ptr = m4_common.m4memory;

	if ((f = fopen(path, "r")) == NULL)
		return -ENOENT;

	while ((r = fread(buff, sizeof(buff), 1, f)) > 0 && total < m4_common.m4memorysz) {
		if (total + r > m4_common.m4memorysz)
			r = m4_common.m4memorysz - total;

		memcpy((void *)ptr, buff, r);
		ptr += r;
		total +=r;
	}

	return (int)total;
}


static int loadFromBuff(const void *buff, size_t bufflen)
{
	if (bufflen > m4_common.m4memorysz)
		bufflen = m4_common.m4memorysz;

	memcpy((void *)m4_common.m4memory, buff, bufflen);

	return (int)bufflen;
}


static void devctl(msg_t *msg)
{
	imxrt117xM4DevCtli_t *i = (void *)msg->i.raw;
	imxrt117xM4DevCtlo_t *o = (void *)msg->o.raw;

	switch (i->type) {
	case m4_loadBuff:
		if (msg->i.data == NULL || msg->i.size == 0) {
			o->err = -EINVAL;
			break;
		}

		o->err = loadFromBuff(msg->i.data, msg->i.size);
		break;

	case m4_loadFile:
		if (msg->i.data == NULL || msg->i.size == 0) {
			o->err = -EINVAL;
			break;
		}

		o->err = loadFromFile(msg->i.data);
		break;

	case m4_runCore:
		o->err = runCore();
		break;

	default:
		o->err = -EINVAL;
		break;
	}
}


__attribute__((noreturn)) static void thread(void)
{
	msg_t msg;
	unsigned long rid;

	for (;;) {
		if (msgRecv(m4_common.port, &msg, &rid) < 0)
			continue;

		switch (msg.type) {
		case mtRead:
			msg.o.io.err = chanRead(msg.i.io.oid.id, msg.o.data, msg.o.size);
			break;

		case mtWrite:
			msg.o.io.err = chanWrite(msg.i.io.oid.id, msg.i.data, msg.i.size);
			break;

		case mtDevCtl:
			devctl(&msg);
			break;

		case mtOpen:
		case mtClose:
			if (msg.i.openclose.oid.port == m4_common.port && msg.i.openclose.oid.id >= chan0 && msg.i.openclose.oid.id < chanLen)
				msg.o.io.err = EOK;
			else
				msg.o.io.err = -EINVAL;
			break;

		/* Unsupported operations */
		case mtCreate:
			msg.o.create.err = -ENOSYS;
			break;
		case mtLookup:
			msg.o.lookup.err = -ENOSYS;
			break;
		default:
			msg.o.io.err = -ENOSYS;
			break;
		}

		msgRespond(m4_common.port, &msg, rid);
	}
}


int main(int argc, char *argv[])
{
	oid_t oid;
	unsigned int i;
	char path[] = "/dev/cpuM4x";
	const size_t pathlen = sizeof(path);

	/* TODO - get this info from a memory map? */
	m4_common.m4memory = M4_MEMORY_START;
	m4_common.m4memorysz = M4_MEMORY_SIZE;

	m4_common.scr = (void *)0x40c04000;

	if (portCreate(&m4_common.port) < 0) {
		fprintf(stderr, "imxrt117x-m4: Failed to create port\n");
		return -1;
	}

	oid.port = m4_common.port;
	for (i = 0; i < chanLen - chan0; ++i) {
		path[pathlen - 2] = '0' + i - chan0;
		oid.id = chan0 + i;
		if (create_dev(&oid, path) < 0) {
			fprintf(stderr, "imxrt117x-m4: Failed to register the device %s\n", path);
			return -1;
		}
	}

	fprintf(stderr, "%s: Started\n", argv[0]);

	thread();

	/* Never reached */
	return 0;
}
